
#ifndef __EVENTS_H
#define __EVENTS_H

#include "cmsis_os2.h"

//*************************************************************************************************
// ID объектов RTOS с общим доступом
//*************************************************************************************************
extern osThreadId_t task_button;
extern osEventFlagsId_t uart_event, uart_event, cmnd_event;
extern osEventFlagsId_t beep_event, data_event;

#ifdef HARDWARE_TEST
extern osEventFlagsId_t test_event;
#endif

//*************************************************************************************************
// Флаги событий при обмене данными по UART
//*************************************************************************************************
#define EVN_UART_START1         0x00001000  //запуск ожидания приема данных по UART1 
                                            //после завершения выполнения команды
#define EVN_UART_START2         0x00002000  //запуск ожидания приема данных по UART2
                                            //после завершения выполнения команды

#define EVN_UART_MASK           ( EVN_UART_START1 | EVN_UART_START2 )

#define EVN_MASK_RESULT         0x0000000F  //маска для выделения результата выполнения команды

//*************************************************************************************************
// События выполнения команд
//*************************************************************************************************
#define EVN_CMND_EXEC           0x00000001  //выполнение команды
#define EVN_CMND_PROMPT         0x00000002  //вывод символа ">" в консоль
#define EVN_CMND_STATUS         0x00000004  //вывод результата чтения параметров из FLASH
#define EVN_CMND_DATA           0x00000008  //получены данные по порту данных

#define EVN_CMND_MASK           ( EVN_CMND_EXEC | EVN_CMND_PROMPT | EVN_CMND_STATUS | EVN_CMND_DATA )

//*************************************************************************************************
// Флаги подачи звукового сигнала
//*************************************************************************************************
#define EVN_BEEP_SHORT          0x00000001  //короткий звуковой сигнал
#define EVN_BEEP_LONG           0x00000002  //длиный звуковой сигнал
#define EVN_BEEP_LONG1          0x00000004  //длиный звуковой сигнал
#define EVN_BEEP_SHORT3         0x00000008  //три коротких звуковых сигнала

#define EVN_BEEP_MASK           ( EVN_BEEP_SHORT | EVN_BEEP_LONG | EVN_BEEP_LONG1 | EVN_BEEP_SHORT3 )

#endif
