
//*************************************************************************************************
//
// Модуль разбора параметров командной строки
//
//*************************************************************************************************

#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <ctype.h>
#include <stdbool.h>

#include "parse.h"

//*************************************************************************************************
// Локальные переменные
//*************************************************************************************************
static uint8_t cnt_par = 0;
static char param_list[MAX_CNT_PARAM][MAX_LEN_PARAM];

//*************************************************************************************************
// Разбор параметров команды. Если параметров указано больше MAX_CNT_PARAM, 
// лишниние параметры игнорируется
//-------------------------------------------------------------------------------------------------
// char *src - строка с параметрами
// return    - количество параметров, в т.ч. команда
//*************************************************************************************************
uint8_t ParseCommand( char *cmnd ) {

    uint8_t i, ind_param, quote_cnt = 0;
    char *str, *token, *ptr_quote, *end_quote;
   
    //уберем коды \r \n
    for ( i = 0; i < strlen( cmnd ); i++ ) {
        if ( *( cmnd + i ) < 32 )
            *( cmnd + i ) = 0x00;
       }
    //обнулим предыдущие параметры
    memset( param_list, 0x00, sizeof( param_list ) );
    //разбор параметров
    str = cmnd;
    ind_param = 0;
    token = strtok( str, " " );
    while ( token != NULL ) {
        if ( ind_param >= MAX_CNT_PARAM )
            break;
        //поиск ковычки для объединения параметров
        ptr_quote = strstr( token, "\"" );
        if ( ptr_quote != NULL ) {
            if ( strlen( ptr_quote ) > 1 ) {
                //кавычка в начале строки
                ptr_quote++;
                quote_cnt++;
                //проверим наличие кавычек в конце одного параметра
                end_quote = strstr( ptr_quote, "\"" );
                if ( end_quote == NULL )
                    strncpy( param_list[ind_param], ptr_quote, strlen( ptr_quote ) );
                else {
                    //кавычка в конце строки одного параметра
                    quote_cnt = 0;
                    strncpy( param_list[ind_param++], ptr_quote, end_quote - ptr_quote );
                   }
               }
            else {
                //кавычка в конце строки
                quote_cnt = 0;
                //добавляем к текущему параметру без кавычки в конце строки
                strcat( param_list[ind_param], " " );
                strncat( param_list[ind_param++], token, ptr_quote - token );
               }
            token = strtok( NULL, " " );
           }
        else {
            //обычный параметр
            if ( quote_cnt == 1 ) {
                //добавляем к текущему параметру
                strcat( param_list[ind_param], " " );
                strcat( param_list[ind_param], token );
               }
            else {
                strncpy( param_list[ind_param++], token, strlen( token ) );
               }
            token = strtok( NULL, " " );
           }
       }
    if ( quote_cnt )
        return 0;
    else return ind_param;
 }

//*************************************************************************************************
// Возвращает кол-во параметров после разбора ParseCommand()
//-------------------------------------------------------------------------------------------------
// return - кол-во параметров
//*************************************************************************************************
uint8_t GetParamCnt( void ) {

    return cnt_par;
 }

//*************************************************************************************************
// Возвращает указатель на массив параметров
//-------------------------------------------------------------------------------------------------
// return - указатель на массив
//*************************************************************************************************
char *GetParamList( void ) {

    return &param_list[0][0];
 }

//*************************************************************************************************
// Возвращает указатель на значение параметра по индексу
//-------------------------------------------------------------------------------------------------
// uint8_t index - индекс параметра
// return char * - указатель на значение параметра
//*************************************************************************************************
char *GetParamVal( CmndParam index ) {

    if ( index > MAX_CNT_PARAM )
        return NULL;
    return &param_list[index][0];
 }

